from ..credentials import NGROK_URL

welcome_message = """
    Вас приветствует центр современных профессий <b>PROWEB!</b> 🤗
    """

help_message = """

Данный бот разработан специально для студентов центра <b>PROWEB</b>.

Возможности бота:

■ <b>Отправить текстовое сообщение</b> - задать любой вопрос, связанный с вашим обучением, и получить обратную связь в ближайшее время.

■ <b>Тех. поддержка</b> - связаться с технической поддержкой и решить вопросы, связанные с компьютерной техникой. Также можно получить консультацию и помощь в сборке личного комьютера.

■ <b>Коворкинг</b> - связаться с коворкинг администратором и забронировать место на посещение.

■ <b>Конкурсы</b> - принять участие в ежемесечных конкурсах, где можно выиграть ценные призы.

■ <b>Посетить сайт</b> - переход на страницу центра PROWEB, где вы найдете всю подробную информацию о центре и о доступных курсах.

■ <b>Базовый курс</b> - записаться на бесплатный базовый курс компьютерной грамотности.

■ <b>Оставить отзыв</b> - возможность поделиться приятными впечетлениями об обучении в центре PROWEB. Если вы столкнулись с трудностями, можно оставить жалобу или пожелание. Мы благодарны каждому отзыву.

■ <b>Правила обучения</b> - подробная информация о правилах обучения в центре PROWEB.

■ <b>На главную</b> - возможность вернуться на главную страницу бота и увидеть все его возможности.

■ <b>O'zbek till</b> - переключение языка с русского на узбекский.

■ <b>Поделиться контактом</b> - если ваш вопрос имеет личный характер, оставьте свои данные и администрация центра свяжется с вами лично в ближайшее время.
    """

conkurs_message = f"""

Ежемесячно для студентов центра <b>PROWEB</b> проводятся конкурсы с ценными призами! 🎉

Для участия в конкурсах важно оставаться подписанным на нашего бота.

Подробные объявления с условиями конкурсов будут приходить личным сообщением всем подписчикам. Для того, чтобы оставаться подписанным, достаточно просто не удалять и не блокировать бота.

Также мы проводим дополнительные конкурсы для наших подписчиков в Instagram, Youtube, Telegram, Facebook подписывайтесь и участвуйте сразу в нескольких конкурсах.

Всем удачи, шанс выиграть есть у каждого студента! 🍀

<a href="{NGROK_URL}/storage/conkurs.jpg">\u00A0</a>

    """

basic_course_message = f"""
    
Вы совершенно не разбираетесь в комьютере, но при этом хотите обучаться в <b>PROWEB?</b> С нашим базовым курсом это возможно. Для этого вам просто необходимо нажать на кнопку "<b>Записаться на базовый курс</b>" и наш преподаватель вас подробно обо всём проконсультирует.

<a href="{NGROK_URL}/storage/basic_course.jpg">\u00A0</a>
    """

review_message = """
    
Вам нравится обучение в центре <b>PROWEB</b> и вам не трудно поделиться об этом в наших социальных сетях? Тогда переходите по ссылке "<b>Отзывы</b>" и опишите свои впечатления, мы будем очень признательны.
У вас возникли трудности во время обучения или вам что-то не понравилось, а может есть предложения и пожелания? Тогда переходите по ссылке "<b>Жалобы и пожелания</b>", распишите подробнее и мы сделаем все возможное, чтобы улучшить наш учебный центр.
    """

licence_message = """

    <b>Правила обучения в учебном центре PROWEB</b>
    
    1. В одном учебном месяце - 8 занятий. Студентам, оплатившим месяц обучения гарантируется 8 проведенных уроков по утвержденному графику.
    
    2. Если урок отменяется в связи с праздником или по уважительной причине со стороны преподавателя, урок ни в коем случае не сгорает, а просто переносится. Пока все 8 официальных уроков не будут проведены, учебный месяц не закончится.
    
    3. Если студент пропускает запланированный урок, Данный урок засчитывается, так как студент состоит в Telegram группе, в которую скидывается каждый пройденный урок в видео формате.
    
    4. Если студент не может посетить урок, он должен оповестить об этом преподавателя и администрацию.
    
    5. Если студент пропустил урок, то ему рекомендуется посетить коворкинг, в котором находятся преподаватели всех направлений. Преподаватели коворкинга могут помочь разобрать пропущенную тему и помочь в сложных учебных моментах.
    
    6. В период обучения студент может посещать коворкинг каждый день, заранее регистрируясь в доступное время. Для регистрации необходимо связаться с преподавателем коворкинга и забронировать место.
    
    7. Перед стартом курса, или уже во время обучения, студентам с плохими знаниями компьютера рекомендуется записаться на бесплатный базовый курс. За месяц студенты изучат основы компьютерной грамотности. Обучение проходит параллельно с основным курсом. Для записи нужно написать в Telegram.
    
    8. Каждый студент учебного центра PROWEB должен вносить своевременную оплату за каждый месяц обучения в начале учебного месяца, во избежание исключения из группы. Если студент имеет финансовые трудности, то администрация может предоставить недельную отсрочку в выплате, либо студент может вносить частичную оплату в период текущего месяца обучения.
    
    9. Если студент не вносит своевременную оплату и не посещает более трех уроков без уважительной причины, то данный студент автоматически исключается из группы. Для восстановления в группу студент должен погасить задолженность, только после этого он будет восстановлен в свою группу, если та не ушла вперёд. Либо администрация подберет группу, наиболее подходящую данному студенту.
    
    10. Если студент хочет прекратить или приостановить обучение, нужно обязательно оповестить администрацию и объяснить причину, чтобы будущие уроки, которые студент не будет посещать, не засчитывались. Администрация своевременно приостановит обучение и удалит студента из Telegram группы.
    
    11. Студент, приостановивший обучение, может восстановить своё обучение ровно с того месяца и урока, на котором приостановил. Администрация не гарантирует, что восстановиться получится именно к своему преподавателю.
    
    12. Если студент хочет сменить формат обучения, преподавателя, или изменить время и дни обучения, он может обратиться в администрацию центра, которая обязательно ему в этом поможет.
    
    13. Студент, имеющий жалобу или предложение, может обратиться в администрацию учебного центра или к менеджеру обратной связи. Все жалобы и предложения будут обязательно рассмотрены и будут приняты соответствующие меры.
    
    <b>Контакты:</b>
    
    <b>Администрация</b>
    Telegram: t.me/proweb_admin
    Тел: +97 744 66 32
    
    <b>Обратная связь</b>
    Telegram: t.me/proweb_lost_back
    Тел: +88 198 66 32
    
    <b>Коворкинг</b>
    Telegram: t.me/proweb_coworking
    Тел: +97 155 66 32
    
    <b>Базовый курс</b>
    Telegram: t.me/proweb_basics
    """

complain_suggestion_message = """

С какими сложностями вы столкнулись или какие у вас есть предложения по улучшению центра <b>PROWEB?</b>
    
Пожалуйста, Поделитесь контактом нажав "<b>Поделиться контактом</b>", наша администрация свяжется с вами лично и выслушает все ваши замечания или распишите подробнее и отправьте сообщением.
    
    """

text = 'Мы приняли ваш текст и постараемся обработать поскорее'

phone = 'Мы приняли ваши данные и в скором времени свами свяжемся'
